<template>
  <div>
    <div class="text-h6 text-center q-pa-md bg-green text-white">
      হযরত ওমর (রাঃ) এর ওমর ফারুক হওয়ার গল্প
    </div>
    <div class="q-pa-md text-justify">
      <span class="text-h6">হযরত ওসমান রাদিয়াল্লাহু তায়ালা আনহু </span>
      এমন এক ব্যাক্তিত্ত ছিলেন যে, তিনি নর হত্যা করবেন?(নাউযু বিল্লাহ) বরং যখন
      মুনাফেকগন তাকে দীর্ঘদিন নিজ বাসভবনে অবরুদ্ধ রেখে শহীদ করে দেয়ার জন্য উদ্যত
      হল। তখন তিনি তার নিরাপত্তা কর্মীদের পথ ছেড়ে দেয়ার আদেশ দেন। এমনকি তার
      অধিনস্ত কর্মীদের(দাস/দাসী) অনেককে আযাদ করে দেন। যারাই ওসমান (রাঃ) কে রক্ষা
      করার জন্য এগিয়ে এসেছে তাদেরকেই তিনি কড়া ভাষায় নিষেধ করেছেন এই বলে যে, তারা
      যেন কেউ বিদ্রোহীদের উপর আঘাত না করে। তিনি বলেছেন আমি চাইনা আমার রক্তের
      পনের জন্য মুসলিম সম্রাজ্যে বিশৃংখলা ও বিবেদ সৃষ্টি হউক। আমার জন্য কোন
      মুসলমানের রক্তপাত হউক তা আমি চাইনা। বরং আমার প্রানের বিনিময় যদি একটি
      মানুষও বেচেঁ যায় তাহলে ওসমান(রাঃ) পুরো বিশ্বমানবতাকেই বাছাঁতে পারলো বলে
      মনে করবে। পাঠক, এখানে লক্ষ্যনীয় ওসমান (রাঃ) যে চেষ্টা করেছিলেন,(মুসলমানের
      রক্তপাত যেন না হয়) আল্লাহর ইচ্ছায় তা থামানো সম্ভব হয়নি। খারেজী বিদ্রোহী
      পিচাশ আর সাবাঈ নরাধমরা কিন্তু সে রক্তপাত আরাম্ভ করেই ছাড়লো। আর তা স্বয়ং
      খোলাফায়ে রাশেদার তৃতীয় খলীফা,বেহেশ্তের সু সংবাদ প্রাপ্ত, কোমল অন্তরের
      অধিকারী হযরত ওসমান ইবনে আফফান (রাঃ) কে দিয়েই। মুসলিম সম্রাজ্যে মুসলমানদের
      হাতে মুসলমানের রক্তে রঞ্জিত হয় সর্বপ্রথম সহজ-সরল ও সর্বদা বিনয়ী খলিফা
      উসমান (রাঃ) এর লাল রক্ত ধারা বহমান করে। এই যে শুরু আর তার যবনিকাপাত হয়নি।
      মাঝে পৃথিবীর সবচাইতে মহা মুল্যবান আহলেবাইতের সদস্য হযরত হোসাইন (রাঃ) কে
      শহীদ হতে হয় কারবালার প্রান্তরে। প্রমানিত হল ৩৫হিজরির হযরত ওসমান
      রাদিয়াল্লাহু তায়ালা আনহুর শাহাদাত আর ৬১ হিজরীর কারবালার হৃদয় বিদারক
      শাহাদাতের ঘটনা একই সুত্রে গাঁথা। তাহলে আসুন আমরা দেখেনেই কি সেই সুত্র? যার
      কারনে সারা মুসলিম জাহানকে শোকের সাগরে ভাসতে হল। ◙ কে এই ওসমান (রাঃ)? :
      উসমান (রাঃ) এর জন্ম সন ও তারিখ নিয়ে বেশ মতপার্থক্য রয়েছে। অধিকাংশের মতে
      তার জন্ম ৫৭৬ খ্রিষ্টাব্দে অর্থাৎ হস্তীসনের ছয় বছর পর[৫]। এ হিসেবে তিনি
      হযরত মুহাম্মদ (সা.) থেকে ছয় বছরের ছোট। অধিকাংশ বর্ণনামতেই তাঁর জন্ম সৌদি
      আরবের মক্কা নগরীতে। অবশ্য অনেকের বর্ণনামতে তাঁর জন্ম তায়েফ নগরীতে বলা
      হয়েছে। উসমানের কুনিয়া আবু আমর, আবু আবদিল্লাহ, আবু লায়লা। তাঁর উপাধি
      জুন-নুরাইন(ذو النورين (এবং জুল-হিজরাতাইনذو) الهجرتين) তার পিতা আফ্‌ফান এবং
      মাতা আরওরা বিনতু কুরাইজ। তিনি কুরাইশ বংশের উমাইয়্যা শাখার সন্তান ছিলেন।
      তার ঊর্ধ্ব পুরুষ আবদে মান্নাফে গিয়ে মুহাম্মদের (সা.) বংশের সাথে মিলিত
      হয়েছে। তার নানী বায়দা বিনতু আবদিল মুত্তালিব ছিলেন মুহাম্মদের ফুফু। ইসলাম
      গ্রহণের পর মুহাম্মদ (সা.) তাঁর কন্যা রুকাইয়্যার সাথে তাঁর বিয়ে দেন।
      হিজরি দ্বিতীয় সনে তাবুক যুদ্ধের পরপর মদিনায় রুকাইয়্যা মারা যায়। এরপর
      নবী তাঁর দ্বিতীয় কন্যা উম্মু কুলসুমের সাথে তাঁর বিয়ে দেন। এ কারণেই তিনি
      মুসলিমদের কাছে জুন-নুরাইন বা দুই জ্যোতির অধিকারী হিসেবে খ্যাত। তবে এ নিয়ে
      কিছু মতভেদ রয়েছে। যেমন ইমাম সুয়ুতি মনে করেন ইসলাম গ্রহণের পূর্বেই
      ওসমানের সাথে রুকাইয়্যার বিয়ে হয়েছিল[৪]। তবে অধিকাংশ ইতিহাসবেত্তা এই
      ধারণা পরিত্যাগ করেছেন। উসমান এবং রুকাইয়্যা ছিলেন প্রথম হিজরতকারী মুসলিম
      পরিবার। তারা প্রথম আবিসিনিয়ায় হিজরত করেছিলেন। সেখানে তাদের একটি ছেলে
      জন্ম নেয় যার নাম রাখা হয় আবদুল্লাহ ইবন উসমান। এরপর উসমানের কুনিয়া হয়
      ইবী আবদিল্লাহ। হিজরি ৪র্থ সনে আবদুল্লাহ মারা যায়। তাবুক যুদ্ধের পরপর
      রুকাইয়্যা মারা যান। এরপর উসমানের সাথে উম্মু কুলসুমের বিয়ে হয় যদিও তাদের
      ঘরে কোনো সন্তান আসে নি। হিজরি নবম সনে উম্মু কুলসুমও মারা যান। পরবর্তীতে
      তিনি আব্দুর রহমান ইবনে আউফ (রাঃ) এর কন্যা নায়ালা বিনতে ফারাফিসাকে বিবাহ
      করেন।( সুত্রঃ https://bn.wikipedia.org/wiki/উসমান_ইবন_আফ্‌ফান) খেলাফতে আসন
      গ্রহনঃ হযরত ওমর (রাঃ) আবু লুলু নামক এক মুর্তীপুজারী দুরাচারের হাতে আঘাত
      প্রাপ্ত হয়ে যখন অন্তিম শয়নে। এ মুহুর্তে পরপর্তী মুসলিম জাহানের খলিফা কে
      হবেন? এ নিয়ে তিনি অত্যন্ত ব্যকুল হয়ে উঠেন। তখন ওমর (রাঃ) বিষয়টি শুরাহা
      করার জন্য হযরত ওসমান (রাঃ), আলী (রাঃ), তালহা (রাঃ),সাদ বিন আবী
      ওক্কাস(রাঃ),যুবায়ের ইবন আওয়াম (রাঃ),আব্দুর রহমান ইবনে আউফ (রাঃ) সহ প্রমুখ
      সাহাবাদের সমন্বয়ে গঠিত নির্বাচনী পরিষদের উপর ছেড়ে দিলেন এবং তিনি ওসিয়ত করে
      যান এই বলে আমি মৃত্যুর তিন দিনের মধ্যে যেন খলিফা নির্বাচনের কাজটি সমাধা
      হয়। এই তিন দিন ইমামতির দায়িত্ব পালন করবে সুহাইব ইবনে সিনান আর-রুমী (রাঃ)
      এবং তিনি হযরত ওমর (রাঃ) এর জানাজার নামাজের ইমামতি করেন। হযরত ওমর (রাঃ) এর
      শাহাদাতের পর হযরত আব্দুর রহমান (রাঃ) এর নেতৃত্বে ছয় সদস্যের এক নির্বাচনী
      কমিটি মিটিং এ বসেন। সকলের ঐক্যমত্যে খলিফা নির্ধারনের মহান দায়িত্ব পড়ে হযরত
      আব্দুর রহমান (রাঃ) এর উপর তিনি হজ্জে আগমন কারী ব্যক্তি বর্গ, সাধারন জনগন ও
      বিশিষ্টজনের মতামত গ্রহন করে হযরত ওমর (রাঃ) এর দাফনের চতুর্থ দিবসে এসে
      খলিফা হিসেবে হযরত ওসমান (রাঃ) এর নাম ঘোষনা করেন। এই ঘটনার সাথে সাথে নব
      নির্বাচিত খলিফার হাতে সকলে বায়াত গ্রহন করেন। সময়টা রবিবার ১মহররম, ২৪
      হিজরী, মোতাবেক ১৭ই নভেম্বর, ৬৪৪ খ্রীঃ শুরু হল হযরত ওসমান (রাঃ) (রাঃ) এর
      জনগনের সেবার অধ্যায়। দীর্ঘ ১২ বছর অর্থাৎ ২৮জিলহজ্জ ৩৫হিজরী মোতাবেক ১৭ই জুন
      ৬৫৬ খ্রীঃ পর্যন্ত খিলাফতে সমাসীন ছিলেন। খেলাফতে অধিষ্ঠিত হয়ে হযরত ওসমান
      (রাঃ) এর প্রথম ভাষনের কিছু অংশ- আল্লামা সাঈফ ইবনে ওমর (র) বর্ননা করেন,
      হযরত ওসমান (রাঃ) বলেন, হে মানব মন্ডলী ! তোমরা দুর্গের ঘোরে বাস করছো এবং
      নিজেদের আয়ুর বাকী অংশে বসবাস করছো। কাজেই সম্ভাব্য কল্যান সহ তোমরা তোমাদের
      মৃত্যুর দিকে ধাবিত হও। তোমরা সকাল ও সন্ধ্যায় নিজেদের জীবন অতিবাহিত করে
      আসছ। সাবধান! এ দুনিয়া ধোকা ও প্রতারনার সাথে সম্পৃক্ত। কাজেই পার্থিব জীবন
      যাতে তোমাদের কিছুতেই প্রতারিত না করে এবং সেই প্রবঞ্চক যেন তোমাদের কিছুতেই
      আল্লাহ পাক সম্পর্কে প্রবঞ্চিত না করে। যারা চলে গেছেন তাদের দেখে উপদেশ
      গ্রহন কর। তার পর চেষ্টা করবে, উসাসিন হবেনা। কেননা তিনি(আল্লাহ তায়ালা)
      তোমাদের সম্পর্কে অসতর্ক নন। দুনিয়ার সন্তানেরা ও বোনেরা আজ কোথায়? যারা এ
      পৃথিবীকে আবাদ করেছিল, উৎপাদন করেছিল এবং বহুকাল যাবৎ এ দুনিয়া থেকে উপকৃত
      হয়েছিল। দুনিয়া কি তাদের নিক্ষিপ্ত করেনি? দুনিয়ার যেখানে তোমাদের আল্লাহ
      তায়ালা রেখেছেন সেখানেই থাক, আখেরাত কে অন্বেষন কর। নিশ্চয় আল্লাহ তায়ালা
      দুনিয়ার জন্য একটি কল্যান কর উপমা পেশ করেছেন। আল্লাহ তায়ালা বলেন, وَاضْرِبْ
      لَهُمْ مَثَلَ الْحَيَاةِ الدُّنْيَا كَمَاءٍ أَنْزَلْنَاهُ مِنَ السَّمَاءِ
      فَاخْتَلَطَ بِهِ نَبَاتُ الْأَرْضِ فَأَصْبَحَ هَشِيمًا تَذْرُوهُ
      الرِّيَاحُ وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ مُقْتَدِرًا “তাদের জন্য
      দুনিয়ার জীবনের দৃষ্টান্ত তুলে ধরুন। এ জীবন এমন পানির মত যা আমরা আকাশ থেকে
      বর্ষণ করি, ফলে ধরণী উদ্ভিদে ঘন সন্নিবিষ্ট হয়ে যায়। কিন্তু শিগগিরই তা
      শুকিয়ে যায় এবং বাতাস তাকে বিক্ষিপ্তভাবে (সব দিকে) উড়িয়ে নিয়ে যায়।
      আল্লাহ্‌র ক্ষমতা সব কিছুর উপরে শক্তিমান।” (সুরা কাহফ, আয়াত- ৪৫) ধন ঐশ্বর্য
      ও সন্তান সন্তুতি পার্থিব জীবনে শোভা এবং স্থায়ী সৎ কর্ম তোমার প্রতিপালকের
      নিকট পুরস্কার প্রাপ্তির জন্য শ্রেষ্ট এবং বঞ্চিত হিসেবেও উৎকৃষ্ট। বর্ণনা
      কারী বলেন হযরত ওসমান (রাঃ) এই বলে মিম্ভরে বসে পড়েন এবং লোকদের বায়াত গ্রহন
      করেন।
    </div>
  </div>
</template>
<script setup></script>
<style></style>
