<template>
  <div
    class="relative-position text-center text-h6 q-pa-md bg-green text-white"
  >
    <div @click="$router.back()" class="absolute">
      <q-icon name="arrow_back" />
    </div>
    <div>দিনি দাউয়াত</div>
  </div>

  <div
    class="flex justify-between items-center q-pa-md"
    v-for="(item, index) in hadis"
    :key="index"
  >
    <div
      class="bg-green q-mb-md text-white flex justify-center items-center"
      style="width: 40px; height: 40px; border-radius: 50%; margin-top: 5px"
    >
      {{ item.number }}
    </div>
    <div class="text-justify">
      {{ item.hadis }}
    </div>
    <q-separator />
  </div>
</template>
<script setup>
const hadis = [
  {
    number: " ১",
    hadis:
      " নবী কারীম সল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরশাদ  ফরমাইয়াছেন, যে ব্যক্তি কোন অনায় কাজ হইতে দেখে, যদি হাত দ্বারা বন্ধ করিবার শক্তি রাখে তবে উহাকে হাত দ্বারা বন্ধ করিয়া দিবে। যদি এই পরিমান শক্তি না রাখে তবে জবান দ্বারা উহার প্রতিবাদ করিবে। যদি এই ক্ষমতাও না থাকে তবে উহাকে অন্তর দ্বারা উহাকে খারাপ মনে করিবে। আর ইহা হইল ঈমানের সর্বনিম্ন স্তর। (মুসলিম, ইবনে মাজাহ, নাসাঈ)",
  },
  {
    number: "২",
    hadis:
      "নবী কারীম সল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরশাদ  ফরমাইয়াছেন, যখন আমার উম্মত দুনিয়াকে বড় মনে করিতে আরম্ভ করিবে, তখন ইসলামের মর্যাদা ও গুরুত্ব তাহাদের অন্তর হইতে বাহির হইয়া যাইবে এবং যখন সৎ কাজের আদেশ ও অসৎ কাজের নিষেধ পরিত্যাগ করিবে, তখন ওহীর বরকত হইতে বঞ্চিত হইয়া যাইবে। আর যখন একে অপরকে গালি-গালাজ করিতে শুরু করিবে, তখন আল্লাহর দৃষ্টি হইতে পড়িয়া যাইবে। (তিরমিজি)",
  },
  {
    number: "৩",
    hadis:
      "রাসুলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম এরশাদ ফরমাইয়াছেন, যদি কোন কওম বা জামাতের মধ্যে কোন ব্যক্তি গুনাহের কাজে লিপ্ত হয় এবং ঐ  কওম বা জামাতের মধ্যে শক্তি থাকা সত্তেও তাহজায়।উক্ত গুনাহ হইতে বাধা না দেয়, তবে মৃত্যুর পূর্বে দুনিয়াতেই তাহাদের উপর আল্লাহর আজাব আসিয়া যায়। (আবু দাউদ, ইবনে মাজাহ)",
  },

  {
    number: "৪",
    hadis:
      " নবী কারীম সল্লাল্লাহু আলাইহি ওয়াসাল্লাম এরশাদ  ফরমাইয়াছেন, যে ব্যক্তি কোন মুসল্মানের দোষ গোপন করিয়া রাখে, আল্লাহ তায়ালা দুনিয়া ও আখিরাতে তাহার দোষ গোপন করিয়া রাখেন এবং আল্লাহ তায়ালা ঐ পর্যন্ত বান্দার সাহায্য করেন যে পর্যন্ত সে আপন ভাইয়ের সাহায্য করে। (মুসলিম, আবু দাউদ)",
  },
];
</script>
<style scoped></style>
