<template>
  <div class="text-h6 text-center q-pa-md bg-green text-white">
    হযরত আলি (রাঃ) এর জীবন কাহিনি
  </div>
  <div class="q-px-lg q-mt-md">
    <span class="text-h6">হযরত আলি (রা.) ছিলেন ইসলামের চতুর্থ খলিফা।</span> তিনি
    ৬০০ খ্রিষ্টাব্দে মক্কার কুরাইশ বংশের বনু হাশিম গোত্রে জন্মগ্রহণ করেন। তিনি
    মহানবি হযরত মুহাম্মদ (স.) এর চাচা আবু তালিবের পুত্র ছিলেন। তাঁর ডাকনাম ছিল
    আবু তোরাব ও আবুল হাসান। বাল্যকাল থেকেই তিনি হযরত মুহাম্মদ (স.) এর সাথে
    থাকতেন। মহানবি (স.) এর প্রতি তাঁর অগাধ আস্থা ও বিশ্বাস ছিল। তাই দশ বছর
    বয়সেই তিনি ইসলাম গ্রহণ করেন। বালকেদের মধ্যে তিনিই প্রথম ইসলাম গ্রহণকারী
    সাহাবি। মহানবি হযরত মুহাম্মদ (স.) হিজরত করে মদিনা যাওয়ার সময় হযরত আলি
    (রা.) কে আমানতের মালের দায়িত্ব দিয়ে তাঁর বিছানায় রেখে যান। জীবনের কঠিন
    ঝুকিঁ সত্ত্বেও তিনি এ দায়িত্ব যথাযথভাবে পালন করেন। মহানবি (স.) এর দেওয়া
    দায়িত্বের চেয়ে তিনি তাঁর জীবনের মূল্য তুচ্ছ মনে করেছেন, দায়িত্ব পালনই ছিল
    তাঁর কাছে বড় ব্যাপার। হযরত আলি. (রা.) এর মতো সত্যের পথে জীবনবাজি রাখা যুবক
    খুব কম আছে। বীরত্ব হযরত আলি (রা.) ছিলেন শৌর্য-বীর্য ও অসাধারণ শক্তির
    অধিকারী। তাঁর নাম শুনলে কাফিরদের মনে ত্রাস সৃষ্টি হতো। বদর যুদ্ধে অসাধারণ
    বীরত্বের জন্য রাসুল (স.) তাকেঁ যুলফিকার তরবারি উপহার দেন। খায়বারে কামুস
    দুর্গ জয় করলে হযরত মুহাম্মদ (স.) তাকে আসাদুল্লাহ (আল্লাহর সিংহ) উপাধি
    প্রদান করেন। হুদায়বিয়া সন্ধিপত্র তিনি নিজ হাতে লিখেছিলেন। মক্কা বিজয়ের
    সময় মুসলিম বাহিনীর পতাকা তাঁর হাতে ছিল। জ্ঞান সাধনা হযরত আলি (রা.) অসাধারণ
    মেধার অধিকারী ছিলেন। ছোট বেলা থেকেই তিনি ছিলেন জ্ঞান তাপস ও জ্ঞান সাধক। তিনি
    সর্বদা জ্ঞানচর্চা করতেন। হাদিস, তাফসির আরবি সাহিত্য ও আরবি ব্যাকরণে তিনি তার
    যুগের সেরা ব্যক্তিত্ব ছিলেন। কথিত আছে যে, হযরত মুহাম্মদ (স.) জ্ঞানের শহর, আর
    আলি হলেন তার দরজা। তাঁর রচিত দিওয়ানে আলি, নামক কাব্য গ্রন্থটি আরবি
    সাহিত্যের অমূল্য সম্পদ। অনাড়ম্বর জীবনযাপন হযরত আলি (রা.) সারা জীবন জ্ঞান
    সাধনায় ব্যস্ত থাকায় সম্পদ উপার্জন করার সময় পাননি। তিনি অনাড়ম্বর ও
    সহজ-সরল জীবন যাপন করতেন। নিজ হাতে কাজ করে উপার্জন করতেন। কঠোর পরিশ্রম করে
    জীবিকা নির্বাহ করতেন। কখনো না খেয়ে থাকতেন। তবুও আক্ষেপ করতেন না। বাসায়
    কোনো কাজের লোক ছিল না। তাঁর স্ত্রী রাসুলুল্লাহ (স.) এর আদরের কন্যা হযরত
    ফাতিমা (রা.) নিজ হাতে জাতা পিষে গম গুড়ো করতেন ও রুটি তৈরি করতেন। মুসলিম
    জাহানের খলিফা হওয়ার পরও তিনি বাসায় কোনো কাজের লোক রাখেননি। ইসলামের সেবা
    তিনি আর্থিকভাবে সচ্চল না হওয়ার ধন সম্পদ দিয়ে ইসলামের উল্লেখযোগ্য সেবা করতে
    পারেনিন । তবে তার শৌর্য-বীর্য, সাহসিকতা ও লেখনীর মাধ্যমে তিনি ইসলামের অনেক
    সেবা করেছেন। সাহসিকতা, বীরত্ব, জ্ঞানচর্চা , আত্মসংযম ও অনাড়ম্বর জীবনযাপনে
    হযরত আলি (রা.) আমাদের সকলের আদর্শ।
  </div>
</template>
<script setup></script>
