<template>
  <div class="text-h6 text-center q-pa-md bg-green text-white">
    হযরত ওমর (রাঃ) ফারুক হওয়ার গল্প
  </div>
  <div class="q-pa-md text-justify">
    <div>
      <span class="text-hbody1">হযরত ওমর (রাঃ) ইসলাম ধর্ম</span>
      <span class="">
        গ্রহণ করেই রাসূল (সঃ) কে জিজ্ঞাসা করলেন, ”হে আল্লাহর রাসূল (সঃ) বর্তমানে
        মুসলমানের সংখ্যা কত? রাসূল (সঃ) উত্তর দিলেন, ”তোমাকে নিয়ে ৪০ (চল্লিশ)
        জন।” হযরত ওমর (রাঃ) বললেন, ”এটাই যথেষ্ট। আজ থেকে আমরা এই চল্লিশ জন্যই
        কাবা গৃহে গিয়ে প্রকাশ্যে মহান আল্লাহ তায়ালার ইবাদাত করবো। ভরসা মহান
        আল্লাহর। অসত্যের ভয়ে আর সত্যকে চাপা পড়ে থাকতে দেব না।” রাসূল (সঃ) হযরত
        ওমরের (রাঃ) এই সদিচ্ছার উপর খুশি মনে অনুমতি দিলেন। হযরত ওমর (রাঃ) সবাইকে
        নিয়ে তরবারি হাতে ‘আল্লাহু আকবার’ ধ্বনি দিতে দিতে কাবা প্রাঙ্গণে গিয়ে
        উপস্থিত হলেন। মুসলিম দলের সাথে হযরত ওমর (রাঃ) কে এভাবে কাবা প্রাঙ্গণে
        দেখে উপস্থিত কাফের কুরাইশগণ যার পর নাই বিস্মিত ও মনোক্ষুণ্ন হয়ে পড়লেন।
        তাদের মনোভাব দেখে হযরত ওমর (রাঃ) বজ্রকণ্ঠে গর্জন করে বললেন, ”আমি তোমাদের
        সাবধান করে দিচ্ছি, কোন মুসলমানের কেশাগ্র স্পর্শ করলে ওমরের তরবারি
        তোমাদের বিরুদ্ধে উত্তোলিত হবে।” কাবায় উপস্থিত একজন কুরাইশ সাহস করে
        বললেন, ”হে খাত্তাব পুত্র ওমর! তুমি কি সত্যিই মুসলমান হয়ে গেলে? আরবরা তো
        কখনো প্রতিজ্ঞাচ্যুত হয় না। জানতে পারি কি, তুমি কোন জিনিস পেয়ে এমনভাবে
        প্রতিজ্ঞাচ্যুত হলে? হযরত ওমর (রাঃ) উচ্চকণ্ঠে জবাব দিলেন, ”মানুষ যার চেয়ে
        বেশি পাওয়ার কল্পনা করতে পারে না, আমি আজ তেমন জিনিস পেয়ে প্রতিজ্ঞাচ্যুত
        হয়েছি। সেই জিনিসটি হল আল কুরআন।” হযরত ওমর (রাঃ) এর এরূপ তেজোদীপ্ত কথা
        শুনে আর কেউ-ই কোন কথা বলতে সাহস পেল না। বিমর্ষ চিত্তে কাফের কুরাইশগণ
        সবাই সেখান (কাবা প্রাঙ্গণ) থেকে চলে গেল। অতঃপর রাসূল (সঃ) সবাইকে নিয়ে
        কাবা ঘরে নামায আদায় করলেন। সেখানে মুসলমানদের এটাই প্রথম নামায। এর আগে
        মুসলমানরা অতি গোপনে ধর্ম কর্ম পালন করতেন। পোশাক- পরিচ্ছদের পার্থক্যও
        রক্ষা করতে পারতেন না। এজন্য কে মুসলমান, কে পৌত্তলিক তা চেনার উপায় ছিল
        না। এ ঘটনার পর মুসলমানরা পোশাক- পরিচ্ছদ ও ধর্ম কর্মে পৃথক জাতিরূপে
        পরিগণিত হলেন। এই ঐতিহাসিক পরিবর্তন উপলক্ষে রাসূল (সঃ) হযরত ওমর (রাঃ)কে
        ‘আল ফারুক’ বা সত্য মিথ্যার পার্থক্যকারী উপাধিতে ভূষিত করলেন।
      </span>
    </div>
  </div>
</template>
