<template>
  <div
    class="relative-position q-pa-md items-center bg-green q-mb-md text-white"
  >
    <div class="absolute text-h6">
      <q-icon class="" name="arrow_back" @click="$router.back()" />
    </div>
    <div class="text-h6 text-center">প্রত্তেক নামাজ এর পরের দুয়া</div>
  </div>

  <div class="q-pa-md" v-for="(item, index) in dowa" :key="index">
    <div class="q-mb-md q-mt-xs relative-position">
      <div
        class="bg-green text-white text-bold q-py-sm q-px-md absolute"
        style="border-radius: 50%; margin-top: -3px"
      >
        {{ item.number }}
      </div>
      <div class="text-h6 text-center text-bold">{{ item.title }}</div>
    </div>

    <div class="q-mb-md text-justify">
      {{ item.hadis }}
    </div>
    <div class="text-h5 text-bold text-center q-mt-lg">
      {{ item.arbi }}
    </div>
    <p class="text-justify">
      {{ item.pronun }}
    </p>
    <div class="text-justify">{{ item.dowa }}</div>
  </div>
</template>
<script setup>
import { ref } from "vue";

const dowa = [
  {
    number: "১",
    title: "হাদিস শরিফে বর্ণিত আছে যে",
    hadis:
      " বিশ্বনবী হজরত মুহাম্মদ (স.) একদিন তাঁর প্রিয় সাহাবী হজরত মুআজ বিন জাবাল  (রা.)-এর হাত ধরে বললেন, ‘মুআজ! আল্লাহর কসম, আমি তোমাকে ভালোবাসি।’ মুআজ (রা.) তৎক্ষণাৎ উত্তর দিলেন, ‘আমার মা-বাবা আপনার জন্য উৎসর্গিত হোক! আল্লাহর কসম, আমিও আপনাকে ভালোবাসি।’ অতঃপর রাসুলুল্লাহ (স.) বললেন, মুআজ! আমি তোমাকে বলছি, কখনোই নামাজের পরে এ দোয়া পড়তে ভুল করো না।’ (মুসনাদে আহমদ: ২২১১৯; সুনানে আবু দাউদ: ১৫২৪) ",
    arbi: " اللّهُمَّ أَعِنِّيْ عَلٰى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
    pronun:
      "উচ্চারণ: ‘আল্লাহুম্মা আ-ইন্নি আলা জিকরিকা ওয়া শুকরিকা ওয়া হুসনি ইবাদাতিক’",
    dowa: "অর্থ: ‘হে আল্লাহ! আপনার জিকির, আপনার কৃতজ্ঞতা ও শোকর আদায় এবং সুন্দর করে আপনার ইবাদত করতে আপনি আমাকে সাহায্য করুন।’",
  },
  {
    number: "২",
    title: "সূরা হাশরেরে শেষ তিন আয়াত   ",
    hadis:
      "হাদিসে থেকে পাওয়ায় যায়, হযরত মুহাম্মাদ সাল্লাল্লাহু আলাইহি ওয়া সাল্লাম বলেছেন যে ব্যক্তি প্রতিদিন সকালে তিনবার।হাশরের শেষ তিন আয়াত আউযুবিসমিল্লাহিস সামিঈল আলিমিমিনাশ শাইতানির রাজিম পাঠ করার পর সূরা হাশরের শেষ তিন আয়াত পাঠ করবে, আল্লাহ তায়ালা তার ওই বান্দার জন্য সত্তর হাজার রহমতের ফেরেশতা নিযুক্ত করে দিবেন। এবং সেই ফেরেস্তাগন ঐবান্দার জন্য সকাল থেকে সন্ধ্যা পর্যন্ত রহমত ও মাগফিরাতের জন্য দোয়া করতে থাকবে। এবং এই সময়ের মধ্যে সে বান্দা মারা গেলে শাহাদাতের মর্যাদা লাভ করবে।আবার একই ভাবে যে বান্দা প্রতিদিন সন্ধ্যার সময় তিনবার আউযুবিসমিল্লাহিস সামিঈল আলিমিমিনাশ শাইতানির রাজিম পাঠ করার পর সূরা হাশরে শেষের তিন আয়াত পাঠ করবে, আল্লাহ তায়ালা তার ওই বান্দার জন্য সত্তর হাজার রহমতের ফেরেশতা নিযুক্ত করে দিবেন।এবং সেই ফেরেস্তাগন ঐবান্দার জন্য সন্ধ্যা থেকে সকাল পর্যন্ত রহমত ও মাগফিরাতের জন্য দোয়া করতে থাকবে। এবং এই সময়ের মধ্যে সে বান্দা মারা গেলে শাহাদাতের মর্যাদা লাভ করবে। (সুবহানআল্লাহ)",
    arbi: "هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ هُوَ الرَّحْمَنُ الرَّحِيمُ (22) هُوَ اللَّهُ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْمَلِكُ الْقُدُّوسُ السَّلَامُ الْمُؤْمِنُ الْمُهَيْمِنُ الْعَزِيزُ الْجَبَّارُ الْمُتَكَبِّرُ سُبْحَانَ اللَّهِ عَمَّا يُشْرِكُونَ (23) هُوَ اللَّهُ الْخَالِقُ الْبَارِئُ الْمُصَوِّرُ لَهُ الْأَسْمَاءُ الْحُسْنَى يُسَبِّحُ لَهُ مَا فِي السَّمَاوَاتِ وَالْأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ [الحشر:22-24]",
    pronun:
      "উচ্চারণ : হুআল্লা হুল্লাজি লা-ইলাহা ইল্লা হুয়া, আলিমুল গাইবী ওয়াশ শাহাদাতি, হুয়ার রহমানুর রহিম। হুআল্লা হুল্লাজি লা-ইলাহা ইল্লা হুয়াল মালিকুল কুদ্দুসুস সালামুল মু’মিনুল মুহাইমিনুল আজিজুল জাব্বারুল মুতাকাব্বির। ছুবহানাল্লোহি আম্মা ইয়ূশরিকুন। হুআল্লাহুল খলিকুল বা-রিউল মুছাওওয়িরু লাহুল আসমাউল হুসনা। ইউছাব্বিহু লাহু মা ফিস-সামাওয়াতি ওয়াল আরদ্ব; ওয়া হুয়াল আজিজুল হাকিম।",
    dowa: "অর্থ : ‘তিনিই আল্লাহ্ তা’আলা, যিনি ব্যতীত কোনো উপাস্য নেই; তিনি দৃশ্য ও অদৃশ্যকে জানেন, তিনি পরম দয়ালু, অসীম দাতা।’ (২২) ‘তিনিই আল্লাহ্ তিনি ব্যতিত কোনো উপাস্য নেই। তিনিই একমাত্র মালিক, পবিত্র, শান্তি ও নিরাপত্তাদাতা, আশ্রয়দাতা, পরাক্রান্ত, প্রতাপান্বিত, মাহাত্মশীল। তারা যাকে অংশীদার করে আল্লাহ্ তা’আলা তা থেকে পবিত্র।’ (২৩) ‘তিনিই আল্লাহ্ তা’আলা, স্রষ্টা, উদ্ভাবক, রূপদাতা, উত্তম নামগুলো তাঁরই। নভোমণ্ডলে ও ভূমণ্ডলে যা কিছু আছে, সবই তার পবিত্রতা ঘোষণা করে। তিনি পরাক্রান্ত প্রজ্ঞাময়। (সুরা হাশর, আয়াত : ২৪)",
  },

  {
    number: "৩",
    title: "আয়াতুল কুরসির ফজিলত",
    hadis:
      "আবু উমামা (রা.) থেকে বর্ণিত নবি (সা.) বলেন, যে ব্যক্তি প্রত্যেক ফরজ নামাজের পর ‘আয়াতুল কুরসি’ পাঠ করবে, সে ব্যক্তির জন্য তার মৃত্যু ছাড়া আর অন্য কিছু জান্নাত প্রবেশের পথে বাধা হবে না।",
    arbi: "للَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ ",
    pronun:
      "আল্লাহু লা ইলা-হা ইল্লা হুওয়াল হাইয়্যুল কাইয়ুম, লা তা’খুজুহু সিনাতুঁও ওয়ালা নাউম। লাহু মা-ফিসসামা-ওয়া-তি ওয়ামা ফিল আরদ্ব। মান জাল্লাজি ইয়াশফা’উ ইনদাহু ইল্লা বিইজনিহি। ইয়া’লামু মা বাইনা আইদিহিম ওয়ামা খালফাহুম। ওয়ালা ইয়ুহিতুনা বিশাইইম মিন্ ইলমিহি ইল্লা বিমা- শাআ। ওয়াসি‘আ কুরসিয়্যুহুস সামা-ওয়াতি ওয়াল আরদ্ব। ওয়ালা ইয়াউদুহু হিফজুহুমা ওয়া হুয়াল আলিয়্যূল আজিম।’",
    dowa: "অর্থ: ‘আল্লাহ ছাড়া অন্য কোনো উপাস্য নেই, তিনি চিরঞ্জীব, সবকিছুর ধারক। তাঁকে তন্দ্রা ও নিদ্রা স্পর্শ করতে পারে না। আসমান ও জমিনে যা কিছু রয়েছে, সবই তাঁর। কে আছ, যে সুপারিশ করবে তাঁর কাছে তাঁর অনুমতি ছাড়া? দৃষ্টির সামনে কিংবা পেছনে যা কিছু রয়েছে, সে সবই তিনি জানেন। তাঁর জ্ঞানসীমা থেকে তারা কোনো কিছুকেই পরিবেষ্টিত করতে পারে না, কিন্তু যতটুকু তিনি ইচ্ছা করেন। তাঁর কুরসি সমস্ত আসমান ও জমিনকে পরিবেষ্টিত করে আছে। আর সেগুলোকে ধারণ করা তাঁর পক্ষে কঠিন নয়। তিনিই সর্বোচ্চ এবং সর্বাপেক্ষা মহান।’",
  },
];
</script>
<style></style>
