<template>
  <div
    class="relative-position q-pa-md items-center text-center text-h6 bg-green q-mb-md text-white"
  >
    <div class="flex absolute">
      <q-icon name="arrow_back" @click="$router.back()" />
    </div>
    <div>নামাযের দোয়া</div>
  </div>

  <div class="q-pa-md">
    <div
      class="text-center q-mb-lg"
      v-for="(item, index) in salat"
      :key="index"
    >
      <div class="text-h6">{{ item.title }}</div>
      <div class="text-body1 text-center">
        {{ item.dowa }}
      </div>
      <div class="q-py-md">
        <span class="text-bold">বাংলা উচ্চারনঃ</span> {{ item.pronun }}
      </div>
      <div><span class="text-bold">অর্থঃ</span> {{ item.mening }}</div>
    </div>
  </div>

</template>
<script setup>
const salat = [
  {
    title: "জায়নামাজের দোয়া",
    dowa: "اِنِّىْ وَجَّهْتُ وَجْهِىَ لِلَّذِىْ فَطَرَالسَّمَوَتِ وَاْلاَرْضَ حَنِيْفَاوَّمَااَنَا مِنَ الْمُشْرِكِيْنَ",
    pronun:
      " ইন্নি ওয়াঝ্ঝাহ্তু ওয়াঝহিয়া লিল্লাজি ফাত্বারাস সামাওয়াতি ওয়াল আরদা হানিফা; ওয়া মা আনা মিনাল মুশরিকিন।",
    mening:
      " ‘আমি এক মুখী হয়ে স্বীয় মুখমণ্ডল সেই সত্তার দিকে করছি, যিনি নভোমণ্ডল ও ভুমণ্ডল সৃষ্টি করেছেন এবং আমি মুশরিক নই।’",
  },
  {
    title: "তাশাহুদ",
    dowa: "ٱلتَّحِيَّاتُ لِلَّٰهِ وَٱلصَّلَوَاتُ وَٱلطَّيِّبَاتُ، ٱلسَّلَامُ عَلَيْكَ أَيُّهَا ٱلنَّبِيُّ وَرَحْمَةُ ٱللَّٰهِ وَبَرَكَاتُهُ، ٱلسَّلَامُ عَلَيْنَا وَعَلَىٰ عِبَادِ ٱللَّٰهِ ٱلصَّالِحِينَ، أَشْهَدُ أَنْ لَا إِلَٰهَ إِلَّا ٱللَّٰهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ.",
    pronun:
      "আত্তাহিয়্যাতু লিল্লাহি ওয়াস্ সালাওয়াতু, ওয়াত্ তাইয়িবাতু। আস্সালামু ‘আলাইকা আইয়্যুহান নাবীয়্যু ওয়া রাহমাতুল্লাহি ওয়া বারাকাতুহু। আস্সালামু আলাইনা ওয়া আলা ইবাদিল্লাহিস্ সলিহীন। আশহাদু আল-লা-ইলাহা ইল্লাল্লাহু ওয়া আশহাদু আননা মুহাম্মাদান আবদুহু ওয়া রাসুলুহু।",
    mening:
      "আমাদের সকল সালাম শ্রদ্ধা, আমাদের সব নামায এবং সকল প্রকার পবিত্রতা একমাত্র আল্লাহর উদ্দেশ্যে। হে নবী, আপনার প্রতি সালাম, আপনার উপর আল্লাহর রহমত এবং অনুগ্রহ বর্ষিত হউক। আমাদের এবং আল্লাহর সকল নেক বান্দাদের উপর আল্লাহ্র রহমত এবং অনুগ্রহ বর্ষিত হউক। আমি সাক্ষ্য দিচ্ছি যে, আল্লাহ ছাড়া (ইবাদাতের যোগ্য) আর কেউ নেই, আমি আরও সাক্ষ্য দিচ্ছি যে, হযরত মুহাম্মাদ সা. আল্লাহর বান্দা এবং রাসূল।",
  },
  {
    title: "দুরুদ শরিফ",
    dowa: "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيتَ عَلَى إِبْرَاهِيمَ، وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
    pronun:
      "আল্লাহুম্মা সাল্লি আলা মুহাম্মাদিউ ওয়া আলা আলি মুহাম্মাদিন, কামা সাল্লাইতা আলা ইবরাহিমা ওয়া আলা আলি ইবরাহীমা ইন্নাকা হামিদুম মাজিদ। আল্লাহুম্মা বারিক আলা মুহাম্মদিউ, ওয়া আলা আলি মুহাম্মদিম, কামা বারাকতা আলা ইবরাহীমা, ওয়া আলা আলি ইবরাহিমা, ইন্নাকা হামিদুম মাজিদ।",
    mening:
      "হে আল্লাহ! তুমি মুহাম্মাদ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ও তাঁর বংশধরের প্রতি রহমত নাযিল করো যেমন রহমত নাযিল করেছিলে ইবরাহীম আলাইহিস সালাম ও তাঁর বংশধরের প্রতি। নিশ্চয় তুমি প্রশংসনীয় ও মর্যাদাবান। হে আল্লাহ! তুমি মুহাম্মাদ সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম ও তাঁর বংশধরের প্রতি বরকত নাযিল করো যেমন বরকত নাযিল করেছিলে ইবরাহীম আলাইহিস সালাম ও তাঁর বংশধরের প্রতি। নিশ্চয় তুমি প্রশংসনীয় ও মর্যাদাবান। (সহীহ বুখারী, হাদীস:২৯৭০)",
  },
  {
    title: "দোয়ায়ে মাসুরা",
    dowa: "اللّٰهُمَّ إِنِّيْ ظَلَمْتُ نَفْسِيْ ظُلْمْاً كَثِيْراً، وَلاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِيْ مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الغَفُوْرُ الرَّحِيْمُ",
    pronun:
      "আল্লা-হুম্মা ইন্নী যলামতু নাফসী যুলমান কাসীরা। ওয়ালা ইয়াগফিরুয্ যুনূবা ইল্লা আনতা। ফাগফির লী মাগফিরাতাম মিন ‘ইনদিকা ওয়ারহামনী ইন্নাকা আনতাল গাফূরুর রাহীম",
    mening:
      "হে আল্লাহ! আমি আমার নিজের ওপর অনেক যুলুম করেছি। আর আপনি ছাড়া গুনাহসমূহ কেউই ক্ষমা করতে পারে না। অতএব, আমাকে আপনার পক্ষ থেকে বিশেষ ক্ষমা দ্বারা মাফ করে দিন, আর আমার প্রতি দয়া করুন; আপনিই তো ক্ষমাকারী, পরম দয়ালু",
  },
];
</script>
<style scoped></style>
