<template>
  <div class="bg-green q-pa-lg text-white text-h6">
    হযরত আবু বকর (রাঃ) এর জীবন কাহিনী
  </div>
  <div class="q-pa-lg">
    <div class="class=">
      <p>
        <span class="text-body1">ইসলামের ১ম খলিফা হযরত আবু বকর (রা:)</span>।তিনি
        আশারাতুল মুবাশশারার অন্তর্ভুক্ত।হযরত মুহাম্মদ (স:) এর প্রিয় সাহাবি
        ছিলেন।তাছাড়া ইসলামের প্রথম মুসলিম পুুুুরুষ হযরত আবু বকর (র:)। (৫৭৩-৬৩৪
        খ্রিষ্টাব্দ)। ইসলাম ধর্মের প্রথম খলিফা, হযরত মুহম্মদ (সাঃ)-এর শ্বশুর।
        মক্কার বিখ্যাত কুরাইশ বংশে ৫৭৩ খ্রিষ্টাব্দে হযরত আবু বকর সিদ্দীক (রাঃ)
        জন্ম গ্রহণ করেন। তাঁর বাল্য নাম ছিল আবদুল্লাহ্, আবু বকর ছিল তার ডাক নাম।
        ইসলাম গ্রহণ করিবার পর তিনি সিদ্দীক (সত্যবাদী) এবং আতিক (দানশীল) খেতাব
        লাভ করেছিলেন। আবু বকরের পিতার নাম ছিল ওসমান, কিন্তু ইতিহাসে তিনি আবু
        কুহাফা নামেই সুপরিচিত ছিলেন। তাঁর মাতার নাম উম্মুল খায়ের সালমা। আবু
        বকরের মাতাপিতা উভয়েই বিখ্যাত কুরাইশ বংশের তায়িম গোত্রের লোক ছিলেন। তার
        মা প্রথমদিকে ইসলাম ধর্ম গ্রহণ করেন এবং পিতা হিজরীর অষ্টম বৎসরে ইসলামে
        দীক্ষিত হন। জন্ম:-অক্টোবর ৫৭৩ মক্কা,আরব দ্বীপ। মৃত্যু:-২২ আগষ্ট ৬৩৪
        মদিনায়। শাসনকাল :-৮ জুন ৬৩২-২২ আগষ্ট ৬৩৪। স্ত্রী:- কুতাইলা বিনতে আব্দুল
        উজ্জা(তালাকপ্রাপ্ত)। উম্মে রুমান,আসমা বিনতে উমাইস,হাবিবা বিনতে খারিজা।
        সন্তান:-*আব্দুল্লাহ ইবনে আবি বকর *আবদুর রহমান ইবনে আবি বকর *মুহাম্মদ
        ইবনে আবি বকর ★আসমা বিনতে আবি বকর ★আয়েশা (রা:) ★উম্মে কুলসুম বিনতে আবি
        বকর। পূর্ণ নাম:-আব্দুল্লাহ বিন আবি কুহাফা।আবু বকর নামে পরিচিত। পিতা ও
        মাতা:- উসমান আবু কুহাফা ও সালমা উম্মুল খাইর। ভাইবোন:- *মুতাক *উতাইক
        *কুহাফা ইবনে উসমান ★ফাদরা ★কারিবা ★উম্মে আমির বংশ:- সিদ্দিকি। আবু বকরের
        স্ত্রী কুতাইলা বিনতে আবদুল উজ্জা ইসলাম গ্রহণ করেন নি। আবু বকর তাকে তালাক
        দিয়েছিলেন। তার অন্য স্ত্রী উম্ম রুমান ইসলাম গ্রহণ করেন। তার ছেলে আবদুর
        রহমান ইবনে আবি বকর ছাড়া অন্য সবাই ইসলাম গ্রহণ করেছিলেন। ফলে আবু বকরের
        সাথে তার বিচ্ছেদ ঘটে। আবদুর রহমান ইবনে আবি বকর পরবর্তীকালে মুসলিম
        হয়েছিলেন। আবু বকরের ইসলাম গ্রহণ অনেককে ইসলাম গ্রহণে অণুপ্রাণিত করেছে।
        তিনি তার ঘনিষ্ঠ বন্ধুদের ইসলাম গ্রহণে উৎসাহ যোগান। তার দ্বারা উৎসাহিত
        হয়ে অনেকে গ্রহণ করেছিলেন। আবু বকরের অণুপ্রেরণায় ইসলাম গ্রহণকারীদের
        মধ্যে রয়েছেন। হযরত মুহাম্মদএর মৃত্যুর পর তার উত্তরাধিকার নিয়ে
        মুসলিমদের মধ্যে মতপার্থক্য দেখা দেয়। মুহাজির ও আনসাররা নিজেদের মধ্য
        থেকে নেতা নির্বাচনের পক্ষে ছিল। কিছু গোত্র পুরনো প্রথা অণুযায়ী
        গোত্রভিত্তিক নেতৃত্ব ব্যবস্থায় ফিরে যেতে চায়। আনসাররা সাকিফা নামক
        স্থানে একত্রিত হয়ে এ বিষয়ে আলোচনা শুরু করে। এরপর আবু বকর, উমর ও আবু
        উবাইদা ইবনুল জাররাহ এখানে আসেন। সভার আলোচনায় এক পর্যায়ে উমর ইবনুল
        খাত্তাব আবু বকরের প্রতি তার আনুগত্য প্রকাশ করেন এবং আবু উবাইদা ইবনুল
        জাররাহও তার অণুসরণ করেন। এরপর বাকিরাও আবু বকরকে নেতা হিসেবে মেনে নেয়।
        সুন্নিরা তাকে "খলিফাতুর রাসুল" বা "আল্লাহর রাসুলের উত্তরাধিকারী" বলে
        সম্মান করে থাকে। তবে শিয়ারা আবু বকরকে বৈধ খলিফা বলে স্বীকার করে না।
        শিয়া মতাদর্শ অণুযায়ী আলি ইবনে আবি তালিব প্রথম খলিফা হিসেবে যোগ্য। আবু
        বকর ছিলেন ইসলামের এক জলন্ত নক্ষত্র ।তাঁর শাসনামলে ইসলাম ও জনগনের জন্য
        তিনি যুদ্ধও করেছেন। আবু বকরের খিলাফত ২৭ মাস অর্থাৎ দুই বছরের কিছু বেশি
        সময় স্থায়ী ছিল। এই সংক্ষিপ্ত সময়ের মধ্যে তাকে বেশ কিছু অস্থিতিশীলতার
        সম্মুখীন হতে হয় এবং তিনি তা সফলভাবে মোকাবেলা করেন। নতুন নবী দাবিকারী
        বিদ্রোহীদেরকে তিনি রিদ্ধার যুদ্ধে দমন করেছেন। তিনি বাইজেন্টাইন ও সাসনীয়
        সাম্রাজ্যের বিরুদ্ধে অভিযান পরিচালনা করেন যা ইতিহাসের মোড় ঘুরিয়ে দেয়।
        পরে উমর ইবনুুল খাত্তাব ও উসমান ইবনে আফফান এই অভিযান অব্যাহত রেখেছিলেন।
        এসব অভিযানের ফলে মুসলিম সাম্রাজ্য কয়েক দশকের মধ্যে শক্তিশালী হিসেবে
        আবির্ভূত হয়। খলিফা হওয়ার পর তিনি অন্যান্যদের পরামর্শক্রমে তার কাপড়ের
        ব্যবসা ছেড়ে দেন এবং রাষ্ট্রীয় কোষাগার থেকে ভাতা গ্রহণ করতেন। এই মহান
        খলিফা শুধু জীবিত অবস্হায় নয় মৃত্যুর পরেও সকলের চোখের মনি ছিলেন।৬৩৪ সালের
        ২৩ আগস্ট অসুস্থ হয়ে পড়েন। অসুস্থতার মাত্রা বৃদ্ধি পাওয়ায় তিনি
        বিছানায় শায়িতাবস্থায় থাকেন। আবু বকর তার উত্তরসূরি মনোনীত করার জন্য
        প্রয়োজনীয়তা অণুভব করেন যাতে তার মৃত্যুর পর মুসলিমদের মধ্যে সমস্যা দেখা
        না দেয়। অন্যান্য সাহাবীদের সাথে পরামর্শ করে তিনি উমর ইবনুল খাত্তাবকে
        তার উত্তরসূরি হিসেবে নিয়োগ দেন। ৬৩৪ সালের ২৩ আগস্ট আবু বকর মারা যান।
        আয়েশার ঘরে হযরত মুহাম্মদ (স:)এর পাশে তাকে দাফন করা হয়। ইসলামের এই প্রথম
        খলিফা চির স্বর্ণাক্ষরে ইতিহাসের পাতায় রয়েছেন। । জীবনী পড়ুন এবং নিজেকে
        গড়ুন ।
      </p>
    </div>
  </div>
</template>
